In [3]:
import pandas as pd
import numpy as np

In [37]:
d={'Country':['France','Spain','Germany','Spain','Germany'],'Age':[44,27,30,38,40],'Salary':[72000,48000,54000,61000,np.nan],'Purchased':['No','Yes','No','No','Yes']}

In [38]:
x=pd.DataFrame(d)

In [39]:
x

   Country  Age   Salary Purchased
0   France   44  72000.0        No
1    Spain   27  48000.0       Yes
2  Germany   30  54000.0        No
3    Spain   38  61000.0        No
4  Germany   40      NaN       Yes

In [40]:
data=x.fillna(value=x['Salary'].mean())

In [41]:
data

   Country  Age   Salary Purchased
0   France   44  72000.0        No
1    Spain   27  48000.0       Yes
2  Germany   30  54000.0        No
3    Spain   38  61000.0        No
4  Germany   40  58750.0       Yes

In [42]:
from sklearn.preprocessing import LabelEncoder
lb=LabelEncoder()

In [44]:
data.iloc[:,0]=lb.fit_transform(data.iloc[:,0])
data

   Country  Age   Salary Purchased
0        0   44  72000.0        No
1        2   27  48000.0       Yes
2        1   30  54000.0        No
3        2   38  61000.0        No
4        1   40  58750.0       Yes

In [48]:
data=data[['Country','Age','Salary']]

In [49]:
data

   Country  Age   Salary
0        0   44  72000.0
1        2   27  48000.0
2        1   30  54000.0
3        2   38  61000.0
4        1   40  58750.0

In [51]:
from sklearn.preprocessing import OneHotEncoder

In [53]:
oh=OneHotEncoder(categorical_features=[0])
data=oh.fit_transform(data).toarray()

In [54]:
data

array([[1.000e+00, 0.000e+00, 0.000e+00, 4.400e+01, 7.200e+04],
       [0.000e+00, 0.000e+00, 1.000e+00, 2.700e+01, 4.800e+04],
       [0.000e+00, 1.000e+00, 0.000e+00, 3.000e+01, 5.400e+04],
       [0.000e+00, 0.000e+00, 1.000e+00, 3.800e+01, 6.100e+04],
       [0.000e+00, 1.000e+00, 0.000e+00, 4.000e+01, 5.875e+04]])

In [61]:
import numpy as np

In [66]:
data=data[0:,1:]

In [68]:
data

array([[0.000e+00, 0.000e+00, 4.400e+01, 7.200e+04],
       [0.000e+00, 1.000e+00, 2.700e+01, 4.800e+04],
       [1.000e+00, 0.000e+00, 3.000e+01, 5.400e+04],
       [0.000e+00, 1.000e+00, 3.800e+01, 6.100e+04],
       [1.000e+00, 0.000e+00, 4.000e+01, 5.875e+04]])